---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.Dispose
source: html/3567b524-9ce9-cc52-0576-29893213f4f3.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.Dispose Method

Releases all resources used by the IFCAnyHandle

## Syntax (C#)
```csharp
public void Dispose()
```